Revit 2026 API

# ZoneArea Property

---

Get the Area of the Zone.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Area { get; }
```
```vb
Public ReadOnly Property Area As Double
	Get
```
```cpp
public:
property double Area {
	double get ();
}
```
```fsharp
member Area : float with get
```

#### Property Value

Double

This property is used to get the Area of the Zone.

#### Reference

Zone Class

Autodesk.Revit.DB.Mechanical Namespace